tutorials/cases/canonical/conservation/gatedBandSources/0.orig/G
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // Held at a fixed irradiation, so G is a real field the solid could
    // absorb from. Ungated it would book 100*(1e5 - 4*sigma*1200^4), about
    // -3.7e+07 W/m3; the assertion is that it books exactly 0.
    wall
    {
        type            fixedValue;
        value           uniform 1e5;
    }
}

// ************************************************************************* //
