tutorials/cases/canonical/conservation/gatedBandSources/0.orig/porosityF
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      porosityF;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

// Above criticalPorosity (0.9999) in every cell, so
// solidSourceTermsAdmissible is 0 from t = 0, while solidOccupiesCell and
// radiatingCellHasSolid both stay 1 - 0.99995 is below 1 and below 1 - 1e-8.
// The bed exists; nothing it does is allowed to reach an energy equation.
internalField   uniform 0.99995;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
