tutorials/cases/canonical/conservation/gatedBandSources/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry           on;

chemistryType
{
    solver            ode;
}

solidChemistryType
{
    solver              solidOde;
    method              ODESolidHeterogeneousChemistryModel;
    solidThermoType     const<constRad<constThermo<constRho>>>;
}

initialChemicalTimeStep 1e-1;

turbulentReaction   off;
solidReactionEnergyFromEnthalpy false;
stoichiometricReactions false;
showRelativeReactionRates false;
solidChemistryTimeStepControl true;

odeCoeffs
{
    solver      seulex;
}

solidOdeCoeffs
{
    solver      seulex;
}

#include "reactions"

// Endothermic on purpose, and only mildly so: 1e4 J/kg drifts Ts by tens of
// kelvin over the run rather than running away, so chemistrySh is genuinely
// nonzero without the Arrhenius rate feeding back on itself.
solidReactions
(
    irreversibleSolidArrheniusHeterogeneousReaction
    wood = targas
    (10 2000 300 1e4 1)
);

// ************************************************************************* //
