tutorials/cases/canonical/conservation/gatedBandSources/constant/heatTransferProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      heatTransferProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

heatTransferModel constCONV;

// Live, unlike the sibling conservation fixtures: every source this case
// gates off is configured to be large, so the zeros mean refusal and not
// absence.
Parameters
{
    h   2.0;
    SAV 1000;
}

// ************************************************************************* //
