tutorials/cases/canonical/conservation/gatedBandSources/constant/reactions
species
(
    targas N2
);

reactions
(
);
